app/controllers/annonces_controller.rb

  def index
    @annonces = Annonce.all
---
SELECT "annonces".* FROM "annonces"

  def create
    @annonce = Annonce.new(annonce_params.merge(author: current_user))

    respond_to do |format|
      if @annonce.save
---
INSERT INTO "annonces" ("author_id", "created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "titre", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @annonce.destroy
---
DELETE FROM "annonces" WHERE "annonces"."id" = $1  [["id", 1]]

    def set_annonce
      @annonce = Annonce.find(params[:id])
---
SELECT "annonces".* FROM "annonces" WHERE "annonces"."id" = $1 LIMIT 1  [["id", "2"]]